Revit 2027 API
BuiltInFailures.CopyPasteFailures.CopyImposterLightWarn Property
 Light source cannot be copied!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CopyImposterLightWarn { get; }
Public Shared ReadOnly Property CopyImposterLightWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CopyImposterLightWarn {
	FailureDefinitionId^ get ();
}
static member CopyImposterLightWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace